<style type="text/css">
	.el-collapse-item__header{
	 	color: #0e4fd2;
	 	font-size: 13px;
	 }
</style>
<template>
<el-card> 
			<p slot="header">
			 	<span class="fa fa-question-circle"> 帮助文档</span>
			</p>
			<el-row :gutter="24">
	       	<el-col :span="16" :offset='4'>
					<el-collapse v-model="activeNames" accordion>
						<el-card class="box-card">
							<div>
							  	<el-collapse-item title="参数配置" name="1" >
								  	<!-- 参数设置 -->
								    <div><b>系统参数</b>：监测监控系统中配置系统证书，可以上传CA根证书、公钥、私钥等。配置上传接口，用户点击上传，上传完毕显示上传状态。</div>

								    <div><b>传感器参数配置</b>：监测监控系统中所有传感器的展示及配置。左边列出传感器的总类，包括分站分类、模拟量传感器分类、开关量传感器分类，可以通过不同的分类快速准确找到想监测的传感器，用户点击左边的文字，右边显示出对应的传感器。可以对其进行删除、编辑、查看实时曲线图、查看运行日志等操作。用户点击实时曲线图可以查看当前时间1小时前的传感器数据。用户点击运行日志可以查看最近一次对传感器的操作情况，包括读取设备运行参数、传感器写入设备信息等，在弹出框内点击更多日志可以查看这个传感器的所有操作情况。</div>

								    <div><b>区域类型/位置类型配置</b>：监测监控系统中所有位置类型、区域类型和设施类型等的展示及配置。位置类型展示了名称、报警最值、断电最值、复电最值，可以对其进行编辑修改。区域/设施类型展示了名称和类型，可以对其进行编辑修改。</div>

								    <div><b>模拟量</b>：监测监控系统中模拟量传感器的展示及配置。左边列出模拟量传感器的分类，可以通过传感器类型快速准确找到想监测的模拟量传感器，用户点击左边的文字，右边显示出对应的模拟量传感器。可以对其进行删除、编辑、查看实时曲线图、查看运行日志等操作。用户点击实时曲线图可以查看当前时间1小时前的模拟量传感器数据。用户点击运行日志可以查看最近一次对模拟量传感器的操作情况，包括读取设备运行参数、模拟量传感器写入设备信息等，在弹出框内点击更多日志可以查看这个模拟量传感器的所有操作情况。</div>

								    <div><b>开关量</b>：监测监控系统中开关量传感器的展示及配置。左边列出开关量传感器的分类，可以通过传感器类型快速准确找到想监测的开关量传感器，用户点击左边的文字，右边显示出对应的开关量传感器。可以对其进行删除、编辑、查看实时曲线图、查看运行日志等操作。用户点击实时曲线图可以查看当前时间1小时前的开关量传感器数据。用户点击运行日志可以查看最近一次对开关量传感器的操作情况，包括读取设备运行参数、开关量传感器写入设备信息等，在弹出框内点击更多日志可以查看这个开关量传感器的所有操作情况。</div>

								    <div><b>累计量</b>：监测监控系统中瓦斯抽放传感器、设备的展示及配置。左边列出传感器的分类，可以通过不同的分类快速准确找到想监测的传感器，用户点击左边的文字，右边显示出对应的传感器。可以对其进行删除、编辑、查看实时曲线图、查看运行日志等操作。用户点击实时曲线图可以查看当前时间1小时前的传感器数据。用户点击运行日志可以查看最近一次对开关量传感器的操作情况，包括读取设备运行参数、传感器写入设备信息等，在弹出框内点击更多日志可以查看这个传感器的所有操作情况。</div>

								    <!-- <div><b>数据上传</b>：略</div>
								    
								    <div><b>文件解密</b>：略</div> -->

								    <div><b>区域配置</b>：监测监控系统中配置了区域类型的区域的展示。展示内容包括区域的名称以及区域配置的类型，区域类型下面的多个位置类型，每个位置类型对应的传感器等。</div>

								    <div><b>区域规则配置</b>：监测监控系统中区域类型、设施类型等的位置类型的展示及配置。展示内容包括区域类型、设施类型等名称以及部分对应示意图，区域类型、设施类型等包含的位置类型及属性。可以新增区域类型、设施类型及包含的位置类型和属性。</div>
							    </el-collapse-item>
								<el-collapse-item title="页面编辑" name="2" >
									<div><b>列表</b>：监测监控系统中传感器实时列表、开关量传感器实时调用列表、模拟量传感器实时调用列表等表头显示顺序的编辑,传感器实时列表表头默认顺序是设备编号，设备信息，状态，值，用户可以自己拖拽改变显示顺序；开关量传感器实时调用列表表头默认顺序是地点/名称/类型，当前值，状态，报警时刻-报警/解除，断电时刻-断电/复电，断电区域-馈电状态及时刻，用户可以自己拖拽改变显示顺序；模拟量传感器实时调用列表表头默认顺序是地点/名称/类型，报警门限，断电门限，复电门限，实时值，状态，最大值，最小值，平均值，超限报警时刻-报警/解除，断电报警时刻-断电/复电，断电区域-馈电状态，用户可以自己拖拽改变显示顺序；</div>

									<div><b>曲线</b>：监测监控系统中传感器报警曲线、传感器断电控制曲线、传感器馈电异常曲线等表头显示顺序的编辑及曲线显示颜色的编辑。传感器报警曲线表头默认顺序是地点/名称，报警门限（下/上），读值时刻，监测值，调校，最大值，平均值，报警/解除，断电/复电，馈电状态，措施及时刻，用户可以自己拖拽改变显示顺序；传感器断电控制曲线表头默认顺序是地点/名称，断电门限（下/上），断电范围，读值时刻，监测值，调校，最大值，平均值，报警/解除，断电/复电，馈电状态，措施及时刻，用户可以自己拖拽改变显示顺序；传感器馈电异常曲线表头默认顺序是地点/名称，复电门限（下/上），读值时刻，最大值，监测值，调校，平均值，报警/解除，断电/复电，馈电状态，措施及时刻，用户可以自己拖拽改变显示顺序；</div>

									<div><b>模拟图</b>：监测监控系统中上传监控系统、通风系统、瓦斯抽放系统的底图。用户可以通过点击或者直接将模拟图拖拽进页面指定部分进行上传。</div>

									<!-- <div><b>GIS地图底图编辑</b>：略</div>
									
									<div><b>GIS地图设备编辑</b>：略</div> -->

							    </el-collapse-item>
							  	<el-collapse-item title="控制" name="3" >
									<div><b>控制逻辑</b>：联动配置，实现模拟量的逻辑开关与报警，及报警后的一系列动作，如人员呼叫、开关量的接通断开、语音广播等。</div>
									<div><b>操作</b>：遇到情况时，用户可以手动控制断电控制器、断馈电仪器的断开与接通以及可以手动操作矿用本安型声光报警器的一级报警、二级报警、三级报警、四级报警与关闭报警。</div>
									<div><b>风瓦电闭锁</b>：遇到情况时，手动控制开关量的断开与接通。</div>

							    </el-collapse-item>
									<!-- 列表显示 -->
							  	<el-collapse-item title="列表显示" name="4" >
									<div><b>实时显示</b>：监测监控系统中展示所有传感器的实时设备状态与监测的值，用户可以根据左边的分类快速找到自己想查看的设备。页面会自动更新设备的实时信息。</div>
									<div><b>报警</b>：监测监控系统中展示所有处于报警状态的传感器。包括模拟量传感器与开关量传感器，页面会自动更新传感器的实时报警信息。</div>
									<div><b>断电控制</b>：监测监控系统中展示所有处于断电状态的传感器。包括模拟量传感器与开关量传感器，页面会自动更新传感器的实时断电信息。</div>
									<div><b>馈电异常</b>：监测监控系统中展示所有处于馈电异常状态的传感器。包括模拟量传感器与开关量传感器，页面会自动更新传感器的实时馈电异常信息。</div>
									<div><b>调用</b>：监测监控系统中展示所有模拟量传感器和开关量传感器的实时情况，展示内容包括设备名称、设备地点、设备状态、实时值、最近一次报警开始结束时间、最近一次断电开始结束时间等。用户可以根据区域、位置、传感器信息等方式快速筛选查看对应的传感器，页面会自动更新设备的实时信息。</div>
									<div><b>设备故障</b>：监测监控系统中展示所有处于故障状态的传感器，页面会自动更新传感器的实时故障信息。</div>
									<div><b>状态变动</b>：监测监控系统中展示所有开关量传感器的状态变动情况，展示内容包括设备名称、设备地点、设备状态、状态变动时刻、最近一次报警开始结束时间、最近一次断电开始结束时间等。用户可以根据传感器信息快速筛选查看对应的传感器，页面会自动更新设备的实时信息。</div>
									<div><b>模拟量密采记录</b>：监测监控系统中展示所有模拟量传感器的最近时间情况，展示内容包括设备名称、设备地点、设备状态、报警门限、当前值等。用户可以根据设置查询时间以及查询分钟刷新页面。</div>

							    </el-collapse-item>
									<!-- 曲线显示 -->
							  	<el-collapse-item title="曲线显示" name="5" >
									<div><b>报警</b>：监测监控系统中查询一段时间范围内某个模拟量传感器的报警情况，并用曲线展示。曲线展示内容包括断电门限、平均值、复电门限等，双击曲线可以查看模拟量传感器具体某一小时的报警详细数据。曲线下面展示相应数据的表格，展示内容包括设备地点、设备名称、报警门限、读值时刻、监测值、调校、最大值、平均值、报警/解除、断电/复电、馈电状态、措施及时刻等。</div>
									<div><b>断电控制</b>：监测监控系统中查询一段时间范围内某个模拟量传感器的断电控制情况，并用曲线展示。曲线展示内容包括断电门限、平均值、复电门限等，双击曲线可以查看模拟量传感器具体某一小时的断电详细数据。曲线下面展示相应数据的表格，展示内容包括设备地点、设备名称、断电门限、读值时刻、监测值、调校、最大值、平均值、报警/解除、断电/复电、馈电状态、措施及时刻等。</div>
									<div><b>馈电异常</b>：监测监控系统中查询一段时间范围内某个模拟量传感器的馈电异常情况，并用曲线展示。曲线展示内容包括断电门限、平均值、复电门限等，双击曲线可以查看模拟量传感器具体某一小时的馈电详细数据。曲线下面展示相应数据的表格，展示内容包括设备地点、设备名称、复电门限、读值时刻、监测值、调校、最大值、平均值、报警/解除、断电/复电、馈电状态、措施及时刻等。</div>
									<div><b>调用</b>：监测监控系统中查询一段时间范围内某个模拟量传感器的历史数据，并用曲线展示。曲线展示内容包括断电门限、平均值、复电门限等，双击曲线可以查看模拟量传感器具体某一小时的历史详细数据。曲线下面展示相应数据的表格，展示内容包括设备地点、设备名称、报警门限、复电门限、断电门限、断电范围、读值时刻、监测值、调校、最大值、平均值、报警/解除、断电/复电、馈电状态、措施及时刻等。</div>
									<div><b>GD多参曲线</b>：监测监控系统中查询一段时间范围内某个GD多参数传感器的温度、压力、瓦斯浓度、一氧化碳浓度、工况混合流量的历史情况，并用曲线展示。双击曲线可以查看GD多参数传感器具体某一小时的温度、压力、瓦斯浓度、一氧化碳浓度、工况混合流量等详细数据。</div>
							    </el-collapse-item>
									<!-- 状态图及柱状图显示 -->
							  	<el-collapse-item title="状态图及柱状图显示" name="6" >
									<div><b>状态图</b>：监测监控系统中查询一段时间范围内某个开关量传感器的历史状态，并用曲线展示。曲线展示内容包括开、停、断线等，双击曲线可以查看开关量传感器具体某一小时的断电详细数据。曲线下面展示相应数据的表格，展示内容包括设备地点、设备名称、值、读值时刻、调校、报警/解除、断电/复电、馈电状态、措施及时刻等。</div>
									<div><b>柱状图</b>：监测监控系统中查询一段时间范围内某个开关量传感器的开机效率，并用柱状图展示。柱状图展示内容包括开机效率、开机时间、开停时间等，柱状图下面展示相应数据的表格，展示内容包括设备地点、设备名称、报警及断电状态、读值时刻、开机效率、备注、开机时间、开停次数等。</div>
							    </el-collapse-item>
									<!-- 模拟图显示 -->
							  	<el-collapse-item title="模拟图显示" name="7" >
									<div>通风系统、瓦斯抽采(放)、系统自检等系统图展示,用户鼠标左键点击任意系统图，可以查看传感器实时报警信息，传感器实时设备故障信息，开关量实时状态变动信息，传感器实时报警曲线，设备故障信息等。</div>
							    </el-collapse-item>
							    	<!-- 瓦斯抽放 -->
							    <el-collapse-item title="瓦斯抽放" name="8" >
									<div><b>抽放实时列表</b>：监测监控系统中瓦斯抽放系统的传感器所有实时数据，显示内容包括设备编号，地址，状态，类型等，数据会实时自动刷新。用户鼠标左键点击传感器展示内容可以查看该传感器当前时间近一小时内实时曲线。</div>
									<div><b>累计量</b>：监测监控系统中GD多参传感器抽放总累计量、年累计量、月累计量、日累计量的展示，展示内容包括设备编号，设备信息，工况混合流量，标况混合流量，标况纯流量等，用户可以根据设备位置筛选搜索。</div>
									<div><b>抽采测点管理</b>：监测监控系统中抽放系统相关传感器的展示及配置。左边列出传感器的分类，可以通过传感器类型快速准确找到想监测的传感器，用户点击左边的文字，右边显示出对应的传感器。可以对其进行删除、编辑、查看实时曲线图、查看运行日志等操作。用户点击实时曲线图可以查看当前时间1小时前的传感器数据。用户点击运行日志可以查看最近一次对传感器的操作情况，包括读取设备运行参数、传感器写入设备信息等，在弹出框内点击更多日志可以查看这个传感器的所有操作情况。</div>
									<div><b>瓦斯抽放报表</b>：监测监控系统中瓦斯抽放报表的展示。展示内容包括上报时间，设备，位置，标况混合流量累计，标况纯流量累计，标况瞬时混合流量，标况瞬时纯流量，瓦斯浓度，一氧化碳浓度，温度，负压，抽放时间等。用户可以自己定义想查询的时间段，及自己选择想查询的报表类型，报表类型包括时报表，日报表，旬报表，月报表，季报表，年报表。</div>
							    </el-collapse-item>
									<!-- 打印 -->
							  	<el-collapse-item title="打印" name="9" >
									<div>查询某个日期的传感器详细信息，如测点号、地址、类型、单位、报警浓度、报警次数、报警最大值、报警最大值时间、断电次数、断电最大值、断电最大值时间、馈电异常的平均值等信息，报表包括模拟量日(班)报表、模拟量报警日(班)报表、模拟量断电日(班)报表、模拟量馈电异常日(班)报表、开关量报警日(班)报表、开关量断电日(班)报表、开关量馈电异常日(班)报表、开关量状态变动日(班)报表、监控设备故障日(班)报表、模拟量统计值历史记录查询报表、瓦斯抽放报表等，当点击表格中的报警/断电/馈电次数时，会展示出每次报警/断电/馈电的详细信息，报表具有打印功能。</div>
							    </el-collapse-item>
									<!-- 查询 -->
							  	<el-collapse-item title="查询" name="10" >
									<div>查询一段时间范围内的传感器详细信息，如测点号、地址、类型、单位、报警浓度、报警次数、报警最大值、报警最大值时间、断电次数、断电最大值、断电最大值时间、馈电异常的平均值等信息，显示内容包括模拟量报警、模拟量断电、模拟量馈电异常、模拟量调用、开关量报警、开关量断电、开关量馈电异常、开关量调用、开关量状态变动、设备故障记录等，当点击表格中的报警/断电/馈电次数时，会展示出每次报警/断电/馈电的详细信息，查询具有打印功能。</div>
								</el-collapse-item>  
						</div>
						</el-card >
					</el-collapse>					
				</el-col>
			</el-row>
</el-card>
</template>
<script>
import store from 'src/store'

export default {
	data () {
    	return {
    		state:store.state,
    		activeNames:'1',
    	}
    },
    watch:{
		'$route': 'fecthdata',

    },
	methods: {
		fecthdata(){
			this.activeNames = this.$route.query.type + '';
		}
	},
	mounted () {  
	 this.fecthdata()
  },
    
}
</script>